var items = Array(
	"СЪЕЗДИТЬ В ПОПЕНГАГЕН БЕЗ ВИЗЫ",
	"ПОИГРАТЬ В ПОПЕНКРАФТ БЕЗ ХАМАЧИ",
	"ЗАПУСТИТЬ ЗОНД В ЧЁРНУЮ ДЫРУ",
	"ОТКРЫТЬ ЧЁРНЫЙ ЯЩИК",
	"ВЫСАДИТЬ ДЕСАНТ В ДЕВСТВЕННОМ ЛЕСУ КАМБОДЖИИ",
	"ПЬЕР Д'АЧЕЛЛО СОБРАЛ РАКЕТУ НА ЗАДНЕМ ДВОРЕ",
	"БОРОЗДИТЬ ПРОСТОРЫ ЕЁ ТЁМНОЙ ВСЕЛЕННОЙ",
	"ГНОМ УЖЕ СПУСКАЛСЯ В ЕЁ ПЕЩЕРУ",
	"ПОКАТАЛИ ПО ГРЯЗЮКЕ",
	"ПОИГРАТЬ НА ЗАДНЕМ ДВОРЕ",
	"ОТПРАВИТЬ ЧАРЛИ НА ШОКОЛАДНУЮ ФАБРИКУ",
	"КРЕЙСЕР В БУХТУ",
	"ВЗЯТЬ ПРОБУ СО ДНА ВУЛКАНИЧЕСКОГО СРАТЕРА!",
	"ОПУСТИТЬ БАТИСКАФ НА ДНО МАРИАНСКОЙ ПАДИНЫ",
	"ЛОКОМОТИВ УЖЕ ЗАЕЗЖАЛ В ТОННЕЛЬ?",
	"ПОТРОШИТЬ ЧЁРНОГО КРОЛИКА",
	"ПРОБУРИТЬ СКВАЖИНУ У АЛЕКСАНДРА \u200D\u2764\uFE0F\u200D",
	"НЕ СТОИТ ЗАХОДИТЬ С ТЫЛА БЕЗ ТЯЖЁЛОЙ АРТИЛЛЕРИИ",
	"РАЗВОРОШИТЬ ДИКИЙ УЛЕЙ БЕЗ НАКОМАРНИКА",
	"ПРОВОДИТЬ ОПЕРАЦИЮ 'БУРЯ В ЧЁРНОЙ ПУСТЫНЕ' БЕЗ ПОДДЕРЖКИ НАТО",
	"ТОЧЕЧНЫЙ БОМБОВЫЙ УДАР В ТАЙНЫЙ ШТАБ ВРАГА",
	"ПОСТАВЛЯТЬ ТОВАР В ЧЕРНОГОРИЮ",
	"УВИДЕТЬ СВЕТ В КОНЦЕ ТЁМНОГО ТУННЕЛЯ CВОИМ КОЖАНЫМ ФОНАРИКОМ",
	"ПРОСВЕРЛИВАНИЕ ЛУНОК С ПОМОЩЬЮ ЛЕДОБУРА.",
	"ПРОЗОНДИРОВАТЬ ЖЕРЛО ВУЛКАНА",
	"ВЗЯТЬ ПРОБЫ КОРИЧНЕВЫХ ИСКОПАЕМЫХ",
	"ОТДРАИТЬ ЗАДНЮЮ ПАЛУБУ БЕЗ ПЕРЧАТОК",
	"РАЗБУРАВИТЬ БЕСПРОСВЕТНЫЙ ГРОТ",
	"ИССЛЕДОВАТЬ СТАЛАКТИТОВУЮ ПЕЩЕРУ",
	"СВОДИТЬ ЕЁ К ДОКТОРУ ВАЗЕЛИНИ?",
	"ОТПРАВИТЬСЯ НА ЧЁРНЫЙ КОНТИНЕНТ БЕЗ ПРИВИВОК ОТ МАЛЯРИИ?",
	"ЗАНЯТЬСЯ РАЗРАБОТКОЙ УГОЛЬНЫХ МЕСТОРОЖДЕНИЙ ОТКРЫТЫМ СПОСОБОМ",
	"ОТДАТЬ ДАНЬ УВАЖЕНИЯ ЧЁРНОМУ БРАТСТВУ",
	"ПОЕЗДИТЬ ПО БЕЗДОРОЖЬЮ НА СВОЁМ ВОЛОСАТОМ МОТОРОЛЛЕРЕ БЕЗ ШЛЕМА",
	"РЕФРЕШИТЬ ЗА КЛИКИ БЕЗ ГАРАНТИИ ВЫВОДА ДЕНЕГ",
	"ПРОЕХАТЬСЯ ПО ГРЯЗЮЧКЕ?",
	"УСТРОИТЬ РАЛЛИ 'ПАРИЖ - СРАКАР'",
	"ПУСТИТЬ ЗМЕЮ В ЕЁ ТЕМНОЁ ЛОГОВО",
	"СДЕЛАТЬ ШОКОЛАДНОЕ ОБЁРТЫВАНИЕ",
	"НАКИДАТЬ ДРОВ В МАНГАЛ НА ЗАДНЕМ ДВОРЕ",
	"ИССЛЕДОВАТЬ ТЁМНУЮ МАТЕРИЮ",
	"ПОСЕТИТЬ ЕЁ ТЕМНУЮ КОМНАТУ?",
	"ЗАПЛЫТЬ В ЕЁ ТЕМНУЮ ГАВАНЬ?",
	"НЫРНУТЬ В ЕЁ ЧЕРНУЮ ЛАГУНУ?",
	"ПРИШВАРТОВАТЬ ЗАДНЮЮ ЧАСТЬ СУДНА",
	"КОМПЛЕКС ДВИЖЕНИЯ ВО МРАКЕ",
	"ПРИВИНТИТЬ ЕЙ ЗАДНЮЮ СТЕНКУ СИСТЕМНОГО БЛОКА",
	"ВСТАВИТЬ КАРДАН В ЗАДНИЙ МОСТ",
	"СЕСТЬ НА ШОКОЛАДНУЮ ДИЕТУ?",
	"УСТАНОВИТЬ ЗАДНЮЮ ДВЕРЬ",
	"ПРОВЕДЕНИЕ ЗАДНЕЙ РИНОСКОПИИ",
	"ПОПРОБОВАТЬ СЕБЯ В КАЧЕСТВЕ ШОКОЛАТЬЕ",
	"ВЗБИТЬ ШОКОЛАД В ШОКОЛАДНИЦЕ",
	"ПОКАЗАТЬ ЕЙ НОВЫЙ СПОСОБ РЫТЬЯ ТОННЕЛЕЙ?",
	"ПОСТАВИТЬ НОВЫЕ ЗАДНИЕ ФАРЫ",
	"УБРАТЬСЯ В КЛАДОВКЕ?",
	"ПОУЖИНАТЬ ШОКОЛАДНЫМ ФОНДЮ",
	"СВОДИТЬ ЕЁ В ПОПЕНГАГЕН",
	"ЗАДЁРНУТЬ ЗАДНЮЮ ШТОРКУ?",
	"ИЗМЕНИТЬ КОНСТРУКЦИЮ ЗАДНЕЙ ПОДВЕСКИ",
	"ПРИВЫЛЕЧИТЬ ЦЕНТРАЛЬНУЮ ЗАДНЮЮ ГРЫЖУНЯТЬ",
	"ПРИНЯТЬ ШОКОЛАДНУЮ ВАННУ",
	"РАСПРОБОВАТЬ ЕЁ ЧЕРНОСЛИВ",
	"НАТРЕНИРОВАТЬ ЗАДНЮЮ ДЕЛЬТУ?",
	"ЗАСУНУТЬ ФЛЕЙТУ В ЧЁРНЫЙ ФУТЛЯР",
	"ОТЦЕПИТЬ ХВОСТОВОЙ ВАГОН",
	"СМЕНИТЬ ЗАДНИЙ КАНТ?",
	"СМЕНИТЬ ЗАДНЕЕ СТЕКЛО В ЕЁ IPHONE 4",
	"РАСТАРАБАНИТЬ ЕЙ ПОПЧАНСКОГО",
	"СТРЕЛЬБА КОЖАНЫМИ ПУЛЯМИ ПО ЧЕРНЫМ КРУЖОЧКАМ",
	"СУНУТЬ КАРТОШКУ В ГЛУШИТЕЛЬ",
	"РАЗВЕСТИ ЕЁ НА СЕКС В ПЕРДАЧЕЛЛО?",
	"ПОДПИСАТЬСЯ ЗАДНИМ ЧИСЛОМ",
	"ВЫПОЛНИТЬ ЗАДНЕЕ САЛЬТО?",
	"ПОКРАСИТЬ ЗАДНИЙ БАМПЕР",
	"ЗАЙТИ С ЧЁРНОГО ВХОДА",
	"АТАКОВАТЬ С ТЫЛА?",
	"ОСМОТР ТЁМНОГО ЧУЛАНА?",
	"ЗАЙТИ БЕЗ СТУКА ЧЕРЕЗ ЧЁРНЫЙ ВХОД?",
	"ПРОВЕРКА ЗАДНЕГО ПРИВОДА",
	"ВЕЧЕРИНКИ НА ЗАДНЕМ ДВОРЕ",
	"БОРОЗДИЛИ ГЛУБИННЫЕ ТРОПЫ КИРКОЙ",
	"ИССЛЕДОВАЛИ ТЕЛО ЗАДНИМ ЧИСЛОМ",
	"ОХЛАЖДАЛИ ФУКУСИМУ ГРАФИТОВЫМИ СТЕРЖНЯМИ",
	"ПАРКОВКА КОЖАНОГО ЛИМУЗИНА В ТЕМНОМ ТУННЕЛЕ",
	"УСТРОИТЬ ПЕРЕСТРЕЛКУ В КОЖАНОМ САЛОНЕ",
	"ШИРЯЮТСЯ КОЖАНЫМ ШПРИЦОМ В ПЕРДЯЧУЮ ВЕНУ",
	"КИДАТЬ СВОЙ СПИНИНГ В ТЁМНЫЕ ГЛИНИСТЫЕ ВОДЫ"
);

var item = items[Math.floor(Math.random() * items.length)];
document.getElementById("text").innerHTML = item;

function getRandom(item) {
	item = items[Math.floor(Math.random() * items.length)];
	document.getElementById("text").innerHTML = item;
}

var access = document.getElementById("access");

function copyItem(item) {
	var copy = document.getElementById("text");
	if (document.body.createTextRange) {
		var range = document.body.createTextRange();
		range.moveToElementText(copy);
		range.select();
		document.execCommand("Copy");
		access.innerHTML = "Скопировано в буфер обмена";
	} else if (window.getSelection) {
		var selection = window.getSelection();
		range = document.createRange();
		range.selectNodeContents(copy);
		selection.removeAllRanges();
		selection.addRange(range);
		document.execCommand("Copy");
		access.innerHTML = "Скопировано в буфер обмена";
	}
}

setInterval("clearAccess()", 5000);

function clearAccess() {
	access.innerHTML = " ";
}